examples/free-surface-wave/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


mover
{
    type motionSolver;

    motionSolver        explicitImplicitVelocityLaplacian;
    theta               1; //fully implicit for theta=1


    // diffusivity  inverseDistance (air);
    diffusivity  uniform;
    // diffusivity  directional (5 1 1);
    // diffusivity  motionDirectional (1 1000 0);
    // diffusivity  file motionDiffusivity;
}


// ************************************************************************* //
