examples/free-surface-wave/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
    pFinal
    {
        $p
        relTol          0;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-03;
        relTol          0;
    }

    "(cellMotionU|cellMotionUFinal)"
    {
        solver          PCG;
        preconditioner	DIC;
        tolerance       1e-05;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }
    UFinal
    {
        $U
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 3;
    consistent      yes;
    momentumPredictor   yes;
    correctPhi  yes;
    moveMeshOuterCorrectors     yes;

    nCorrectors 1;
    nOuterCorrectors    1000;

    outerCorrectorResidualControl
    {
        p
        {
            tolerance   1e-6;
            relTol      0;
        }

        U
        {
            tolerance   1e-5;
            relTol      0;
        }
    }
}

relaxationFactors
{
    fields
    {
        default 0;
        pFinal  1;
    }
    equations
    {
        default 0;
        U               0.9;
        UFinal          $U;
    }
}


// ************************************************************************* //
